[{"title":"The Dashboard Initiative","id":85,"description":"How to monitor, in near-real-time, usage of all the great services we build and offer? Often stats-production isn't built-in to our services, and when it is, the lack of standard output makes centralized monitoring difficult. Brown's Library is experimenting with a valued corporate solution, building standardized stats output and trend visualization for new and existing projects -- and centrally exposing this info. This talk will cover our dashboard/widget implementation.\nhttp://bspace.us/notes/entries/dashboard-initiative/","score":143},{"title":"Like a can opener for your data silo:  simple access through AtomPub and Jangle","id":86,"description":"Jangle is an open specification to apply the Atom Publishing Protocol (AtomPub) to library systems and data.  It provides a simple RESTful interface that can be accessed with common Atom Syndication and AtomPub clients making it easier to integrate library data into other applications.  This presentation will describe the architecture of Jangle, show how it works and give some ideas as to how it could be used for common integration problems.\nhttp://jangle.org/","score":199},{"title":"Extending biblios, the open source web based metadata editor","id":87,"description":"  This talk will detail how to extend biblios, the open source web based metadata editor.  It will show how to implement two possible enhancements to biblios: 1) develop a network storage folder which uses CouchDB as its backend and 2) develop an editor which supports editing Dublin Core records.  The goal of this talk is to empower other developers to extend and improve biblios.\nhttp://biblios.org","score":136},{"title":"The Open Platform Strategy: what it means for library developers","id":88,"description":"Ex Libris has announced an Open Platform Strategy.  As part of this approach they will supply well-documented “Open-APIs” and Web services. They have also created EL Commons, a collaborative Web-based platform that includes a Developer Zone and a code-sharing platform for customers. OCLC also has an Open-API approach with the WorldCat Grid. This presentation will investigate what this Open-API strategy means for customers and why (or why not) libraries should support this “open”-proprietary strategy.\nhttp://blog.ecorrado.us","score":144},{"title":"LuSql: (Quickly and easily) Getting your data from your DBMS into Lucene","id":89,"description":"Need to move your data from your DBMS to Lucene? The recently released LuSql allows you to do this in a single line. LuSql is a high performance, low use barrier application for getting DBMS data into Lucene. This presentation will introduce LuSql, and give a brief tutorial on simple to crazy complicated use cases, including per document sub-queries and out-of-band document transformations.\nhttp://lab.cisti-icist.nrc-cnrc.gc.ca/cistilabswiki/index.php/LuSql","score":145},{"title":"eXtensible Catalog project update","id":90,"description":"The eXtensible Catalog (XC) Project is developing software to facilitate the discovery of library resources on the web.  XC software will provide a set of next-generation user interfaces and  tools for managing metadata about all kinds of library resources, both digital and non-digital.  This update will cover the range of project activities from user research progress, to software features, and development progress.  The software will be released in July, 2009 under an open-source license.\nhttp://eXtensibleCatalog.org","score":126},{"title":"The Rising Sun: Making the most of Solr power","id":91,"description":"Y'all have been using Solr for a good couple of years now.  It rocks - we know that.  But there is always room for improvement.  Rapid fire, Erik will go through a number of ways to improve existing Solr usage in performance, relevancy, and user interface.\nhttp://www.lucidimagination.com","score":183},{"title":"Managing Library Assets;  A service oriented architecture approach","id":92,"description":"This presentation will demonstrate a prototype system for centralized managment of library assets across a large campus with 20 individual libraries.  Assets such as study rooms, laptops and other equipment available for checkout can be managed such that patrons can determine the availability of any asset via the web.  \r\n\r\nThe system was built using an SOA approach which provides services which can be consumed by the unit libraries web sites on our campus.  ","score":99},{"title":"Freebasing for Fun and Enhancement","id":93,"description":"Freebase is a vast, query-able resource for hierarchical factual information.  Through APIs, we can use this data and data relationships to enhance library services. Want to feature items in your catalog by local authors? Don't waste time hand-selecting, just pull dynamically from Freebase and your local collections.  This presentation will cover how to get information out of Freebase via APIs, an introduction to MQL, and examples of integration with existing library services.","score":163},{"title":"There's more than MARC: an overview of Electronic Resources Management Metadata","id":94,"description":"Electronic Resources Management (ERM) is a relatively new discipline within the library and has recently developed a plethora of new metadata standards in an attempt to simplify and streamline workflows.  This presentation will provide an overview of ERM, its standards, such as SERU, SUSHI and ONIX for Serials, as well as point out some of the needs for new systems to implement these standards.","score":113},{"title":"MARC Authority Records: an efficient way to find books online","id":95,"description":"MARC Authority records are an effective, though underused, way to find books online. My new web site, bookgenius.org, performs Z39.50 federated keyword searches using pazpar2, ranks the subject headings, then searches again against the most frequently occurring subject headings. It uses Zebra, custom database programming, and Ajax to display LOC authority records in a graphical tree. My inspiration: the search strategies in \"The Oxford Guide to Library Research.\"  \nhttp://bookgenius.org","score":108},{"title":"FreeCite - An Open Source Free-Text Citation Parser","id":96,"description":"FreeCite is an open-source Ruby On Rails application that parses document citations into OpenURL-style fielded data. You can use it either as a web application or through a RESTful Web API.  We will explain some difficulties we encountered in developing FreeCite, describe the current architecture, discuss some of the enhancements we would like to see and explain how you can run your own server and/or improve the FreeCite software.\nhttp://freecite.library.brown.edu","score":145},{"title":"A modern open webservice-based GIS infrastructure","id":97,"description":"Demand for curated geospatial data is increasing at academic libraries, as it becomes easier for researchers to use mapping applications (e.g., Google Earth). However, management of such data collections has traditionally been unsupportable. We've developed a solution that combines open source tools for a modern, webservice-based infrastructure for geospatial data. We provide a spatial-data repository and standards-based APIs for our geospatial data collections, allowing researchers to easily use this data in mapping applications.","score":152},{"title":"Using a Web Services architecture with Me, Myself and I","id":98,"description":"We rewrote an instruction/reserves course page system and split our existing webapp into three pieces: a Fedora-based file repository, a Restlet-based service to manage campus course metadata, and a Rails app for building/viewing interfaces. Moving to three components meant a transition to a Web Services architecture. Discussion will include the pros/cons of using a Web Services architecture alone and how we chose appropriate technologies suited to each service’s task.","score":126},{"title":"Mendeley","id":99,"description":"The presentation will describe Mendeley, a free reference/PDF management solution which combines cross-platform (Win, Mac, Linux) desktop software with a web platform. Mendeley is funded by some of the people who built Last.fm, and applies Last.fm's principles to research: Similar to Last.fm's \"Audioscrobbler\", Mendeley scrobbles bibliographic metadata which is aggregated on the web platform to generate research paper usage statistics, an open semantic database of research papers, and reading recommendations.\nhttp://www.mendeley.com","score":107},{"title":"Getting a Leg Up on XForms with Orbeon Form Builder","id":100,"description":"XForms gives developers a way to create data entry forms that separate user interface from underlying data models.  Orbeon Form Builder, an open source visual form builder available as a Developer Preview, provides a simple way to create XForms in a standard web browser.  I'll discuss the current strengths and weaknesses of Form Builder as well as workarounds we've used to speed development of web applications in the Library.","score":104},{"title":"A new frontier - the Open Library Environment (OLE)","id":101,"description":"This presentation will be a progress update on the design of the Open Library Environment.  At the time of the conference, business process modeling workshops will have been completed, thus allowing for presenting how the service-oriented architecture is taking shape.  There will also be details on how to participate in the project.\nhttp://oleproject.org","score":134},{"title":"Using Omeka to build a Digital Collection Registry","id":102,"description":"The Metropolitan New York Library Council is building a registry of the digital collections of our members using Omeka. We will discuss why Omeka is an excellent tool for organizations with rich content but limited resources. We will also talk about using Omeka plug-ins to: (1) import collections from ContentDM, (2) enable contribution of collection objects by community members, (3) make Omeka a more robust metadata creation tool, and (4) harvest and repurpose existing collections.\r\n","score":125},{"title":"Open Up Your Repository With a SWORD!","id":103,"description":"Simple Web Service Offering Repository Deposit (SWORD) is a lightweight protocol for depositing repository objects over HTTP, developed by the JISC.  SWORD is a profile of the Atom Publishing Protocol (RFC 5023), geared to the digital library community. This presentation will discuss the SWORD specification, highlighting how it could be used to provide a deposit API for your repository infrastructure.\nhttp://swordapp.org","score":171},{"title":"Great facets, like your relevance, but can I have links to Amazon and Google Book Search?","id":104,"description":"Solr enabled great innovation and prompted even more.  But they are still just OPACs. Users want much more than a library catalogue alone can provide. This presentation shares some of the experience, code, and techniques used to embed a multiplicity of extension points in to an OPAC interface in a consistent way that can be built upon by others.  From author videos to LibraryThing Common Knowledge by way of an audio page reader and beyond.","score":137},{"title":"A New Platform for Open Data - Introducing ‡biblios.net Web Services","id":105,"description":"‡biblios.net is a new Software-as-a-Service offering based on the open-source ‡biblios metadata editor. ‡biblios.net provides free access to the world's largest database of openly-licensed library records--available under the Open Data Commons license and accessible via ‡biblios.net_Web_Services (BWS). BWS is a simple set of APIs that enable applications to interact with the database.\r\n\r\nThis talk introduces BWS and provides examples of how it can be used by libraries/museums/archives as a platform for storing Openly Licensed Data.\nhttp://biblios.net","score":162},{"title":"Visualizing Media Archives: A Case Study","id":106,"description":"A scholar walks into your archive and asks “what do you have for me?” You point to your finding aids and set them a-slogging. What if they could orient themselves to, and interact with, the collection dynamically online? What if they could see the connections between collections, series, even items? We will present our latest approach to showcasing the breadth and depth of media collections using rich cataloging and data visualization techniques.","score":128},{"title":"Practical web-based Unicode text processing in Perl","id":107,"description":"Lessons learned while developing a multilingual web application that inputs, manipulates, and then outputs UTF-8 encoded text, all while maintaining character set integrity (which is not always as easy as one would think).  The text input sources consist of a backend database, user supplied web form data, and loaded-on-the-fly language modules.  Text manipulation includes Unicode savvy keyword searching.  The text output formats are HTML for the web and plain text for printing and email.\nhttp://rocky.uta.edu/doran/","score":93},{"title":"How Anarchivist Got His Groove Back 2: DVCS, Archival Description, and Workflow Integration","id":108,"description":"Building on Galen Charlton's investigations into distributed version control systems for metadata management, I offer a prototype system for managing archival finding aids in EAD (Encoded Archival Description). My prototype relies on distributed version control to help archivists maintain transparency in their work and uses post-commit hooks to initiate indexing and publishing processes. In addition, this prototype can be generalized for any XML-based metadata schema.","score":131},{"title":"Blacklight as a unified discovery platform","id":109,"description":"At UVA, Blacklight is more than an open source OPAC; it also provides a unified discovery framework for items from our institutional repository, our art museum, and our geospatial data repository, and each kind of object has appropriate specific behaviors. This talk will discuss how we put this together, and how you can too. \nhttp://blacklight.betech.virginia.edu","score":157},{"title":"Web Accessibility in Libraries: serving patrons with disabilities","id":110,"description":"The W3C Web Content Accessibility Guidelines 2.0 were released as a proposed recommendation in November 2008 for users with disabilities covering limitations of vision, hearing, speech, movement, cognition, photosensitivity, and learning.  This presentation will highlight important aspects of web accessibility best practices for coding and content.  It will also address the new WCAG guidelines as they apply to library websites and catalogs and what universities can do to ensure all patrons have fair access experiences.","score":92},{"title":"RESTafarian-ism at the NLA","id":111,"description":"Two years ago the National Library of Australia decided to go the route of SOA, particularly REST web services. Since then we have developed a stack of them for varying projects. This talk will expose a few of those services (that provide MARCXML, MODS, METS, Identity information and Copyright Status), highlight some of the technology choices and give some idea of the success of this approach.\r\n\nhttp://www.nla.gov.au","score":139},{"title":"How to scrape statistics when you can't eat raw fish.","id":112,"description":"The library world waits with baited breath for all the database vendors to become SUSHI compliant to simplify the gathering of electronic resource statistics. Our libraries decided not to wait, so with a little application of Perl and SQL we are scraping by, gather data directly from the vendor web pages. A brief tour of what we did so we could have those all important numbers.\nhttp://www.cclaflorida.org","score":108},{"title":"Built Around a Blog: using Wordpress to store and display data","id":113,"description":"This presentation will highlight powerful data storage and selective display capabilies of object-oriented Wordpress, detailing the successful changeover of front-facing Drexel Libraries research guides from static HTML to Wordpress blogs.  It will show advantages of storing data in blogs, showcasing techniques and new plugins developed at Drexel for easier data retrieval and reusability.  The presentation will also detail current research to adapt this framework to the Drexel Archives collection as a searchable database.\r\n","score":94},{"title":"What We Talk About When We Talk About FRBR","id":114,"description":" When vendors talk about FRBRization they usually mean grouping manifestations into works. When we talk about FRBR, we mean something far richer and rewarding. What FRBRization algorithms are available and in use now, how well do they work, and how do they present the relationships? We'll look at the LC FRBR Display Tool, OCLC's work-set algorithm, LibraryThing's user-contributed groupings, and VTLS's system. We'll discuss their benefits, flaws, and what we need for the future.","score":165},{"title":"Solid State Drives and Lucene","id":115,"description":"The pairing of Flash Solid State Drives and Lucene changes the rules for responsive search-solutions. SSDs out-performs conventional hard discs in just about every area. The gap for random reads is so wide that it moves several bottlenecks from storage to processing. Read-caching becomes largely irrelevant; RAM-requirements drops together with response-times, making it possible to make random updates to large indexes with low latency turnover. We present our findings.","score":111},{"title":"It's Not a Blog: Turning WordPress into the Publishing Platform for an Open Access Journal","id":116,"description":"A year after the launch of the Code4Lib Journal, we continue to tweak WordPress to support our publishing needs. I'll give an overview of the benefits and drawbacks to using WordPress as our CMS, then focus on the plugins we use and have written to overcome some of the pitfalls of using WordPress.\r\n\r\nFocusing on the lessons learned and solutions found over the last year, this shouldn't repeat any of the content presented at c4l2008.\nhttp://journal.code4lib.org/","score":102},{"title":"Complete faceting","id":117,"description":"We wanted search result faceting at our library. Just the basics with tags for material type, author and such. We found a suitable hammer and now have distributed faceting for 100 million documents with 10 times that number of unique tags. All in sync with Lucene indexes. We had to cheat a bit, but you don't see that when we wave our hands. We'll talk about why brute force and cheating is fine.","score":173},{"title":"Why libraries should embrace Linked Data","id":118,"description":"The promise of Linked Data is not that it is another way of aggregating data. For too long have library data been trapped within data-silos only accessible through obscure protocols. Why is access to library data still an issue? Letting everyone access and link to library data lets anyone build the next killer app. LIBRIS, the Swedish Union Catalogue is, since the beginning of this year, available as Linked Data. We discuss how and why.","score":190},{"title":"SummaSlider","id":119,"description":"SummaSlider is an alternative way to make search results fit the user's search context. When the SummaSlider is moved, the Summa search system assigns new weights to the existing search. The search result is updated immediately and presented on-the-fly to the user (using AJAX). Any number of weights can be assigned to the Lucene query, allowing for easy experiments with slider scales.\r\n\r\nWe present the SummaSlider GUI and underlying system.\nhttp://developer.statsbiblioteket.dk/summaslider/","score":127},{"title":"Library Course Views at NCSU","id":120,"description":"The NCSU Libraries' Course Views project, and the supporting RESTful \"widget\" web service, improve course-based access to library collections and services by dynamically generating library course pages for all courses taught at NCSU. Course Views leverages pre-existing data sources and employs a unique cascading content selection approach to customize content for courses. The presentation will describe the Course Views system and the use of web services to achieve scalable and sustainable delivery of library content.\nhttp://www.lib.ncsu.edu/dli/projects/courseviews/","score":111},{"title":"djatoka for dummies","id":121,"description":"What kind of dummy would volunteer to do a presentation on a product he hasn't even tried before?  Perhaps the kind that has three weeks off from work in Dec./Jan.  Or, perhaps the kind that hopes others will join him in this radical experiment.  I'm very interested in learning more about djatoka so propose to share what I learn over the next two months in a twenty minute presentation.","score":135},{"title":"Technostress and the Virtual Reference Librarian","id":122,"description":"Technology has created a more mobile society which has dramatically changed the roles of librarians.Virtual reference is becoming an everyday part of modern librarianship in which librarians will continually be challenged to serve users beyond library walls. A modern disease of adaptation caused by the inability to cope with new computer technologies in a healthy manner,known as “technostress” is examined, showing the critical role librarians can play in reducing the impact of this disease.","score":39},{"title":"LibX 2.0","id":123,"description":"Since its inception, the LibX browser plugin has been adopted by over 500 libraries to provide access to their services at the user's point of need.  We are now developing LibX 2.0, a community platform that allows anybody to create, share, and deploy library services in a distributed and decentralized fashion.  We'll describe the technology used in LibX 2.0, with a particular emphasis on the developer API and the deployment infrastructure facilitating this community engagement.\nhttp://libx.org","score":138},{"title":"Expanding the discovery scope with VuFind","id":124,"description":"Over the past two years, we have seen how VuFind has grown to be a resource discovery platform offering a modern search experience.  The next inherent challenge is to expand the scope of content searched by VuFind to incorporate a broader representation of the library's collection.  This talk will expose how I have been able to expand the scope of content searched to include the library's electronic resources as well as other library catalogs.\nhttp://andrew.webitecture.org/","score":126}]